Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The user to role mappings are specified in the `application.properties` file by properties keys of the form `quarkus.security.users.embedded.roles.<user>=role1[,role2[,role3[,...]]]`. The following xref:roles-example[Example of roles] illustrates the syntax with 4 user-to-role mappings:
ja_jp: ユーザーとロールのマッピングは、 `application.properties` ファイルで、 `quarkus.security.users.embedded.roles.<user>=role1[,role2[,role3[,…​]]]` という形式のプロパティキーによって指定されます。次の xref:roles-example[ロールの例] は、4つのユーザーとロールのマッピングを持つ構文を示しています:

source: The user to role mappings are specified in the `application.properties` file by properties keys of the form `quarkus.security.users.embedded.roles.<user>=role1[,role2[,role3[,...]]]`. The following <<roles-example>> illustrates the syntax with 4 user to role mappings:
ja_jp: ユーザーとロールのマッピングは、 `application.properties` ファイルで `quarkus.security.users.embedded.roles.<user>=role1[,role2[,role3[,…​]]]` 形式のプロパティー・キーで指定されます。以下の link:#roles-example[[role-example]]は、4つのユーザーとロールをマッピングした構文を示しています:

source: The user will be able to select which representation it gets with the link:{httpspec}#section-5.3.2[`Accept`] header, in the case of JSON:
ja_jp: JSON の場合、ユーザーは link:{httpspec}#section-5.3.2[`Accept`] ヘッダーでどの表現を取得するかを選択できます。

source: The user will be returned to the endpoint post logout page once the logout has been completed if the `quarkus.oidc.logout.post-logout-path` property is set. For example, if the endpoint address is `https://application.com/webapp` and the `quarkus.oidc.logout.post-logout-path` is set to "/signin" then the user will be returned to `https://application.com/webapp/signin` (note this URI must be registered as a valid `post_logout_redirect_uri` in the OpenID Connect Provider).
ja_jp: `quarkus.oidc.logout.post-logout-path` プロパティーが設定されている場合、ログアウトが完了すると、ユーザーはエンドポイントのログアウト後ページに戻ります。たとえば、エンドポイントアドレスが `https://application.com/webapp` で、 `quarkus.oidc.logout.post-logout-path` が "/signin" に設定されている場合、ユーザーは `https://application.com/webapp/signin` (この URI は OpenID Connect プロバイダーに有効な `post_logout_redirect_uri` として登録されている必要があることに注意してください)。

source: The user will be returned to the endpoint post-logout page after the logout has been completed, and if the `quarkus.oidc.logout.post-logout-path` property is set. For example, if the endpoint address is `https://application.com/webapp` and the `quarkus.oidc.logout.post-logout-path` is set to `/signin`, then the user will be returned to `https://application.com/webapp/signin`.
ja_jp: ログアウトが完了し、 `quarkus.oidc.logout.post-logout-path` プロパティーが設定されている場合、ユーザーはエンドポイントのログアウト後のページに戻されます。 たとえば、エンドポイントアドレスが `https://application.com/webapp` で、 `quarkus.oidc.logout.post-logout-path` が `/signin` に設定されている場合、ユーザーは `https://application.com/webapp/signin` に戻されます。

source: The user will be returned to the endpoint post-logout page once the logout has been completed and if the `quarkus.oidc.logout.post-logout-path` property is set. For example, if the endpoint address is `https://application.com/webapp` and the `quarkus.oidc.logout.post-logout-path` is set to `/signin`, then the user will be returned to `https://application.com/webapp/signin`. Note, this URI must be registered as a valid `post_logout_redirect_uri` in the OIDC provider.
ja_jp: ログアウトが完了し、 `quarkus.oidc.logout.post-logout-path` プロパティーが設定されている場合、ユーザーはエンドポイントのログアウト後のページに戻されます。 たとえば、エンドポイントアドレスが `https://application.com/webapp` で、 `quarkus.oidc.logout.post-logout-path` が `/signin` に設定されている場合、ユーザーは `https://application.com/webapp/signin` に戻されます。 この URI は、OIDC プロバイダーで有効な `post_logout_redirect_uri` として登録されている必要があることに注意してください。

source: The user, `alice`, has `alice` as their password and `admin` as their role.
ja_jp: ユーザー `alice` のパスワードは `alice`、ロールは `admin` です。

source: The user, `bob`, has `bob` as their password and `user` as their role.
ja_jp: ユーザー `bob` のパスワードは `bob`、ロールは `user` です。

source: The username is optional, in the case of https://www.w3.org/TR/webauthn-3/#discoverable-credential[Discoverable Credentials] (with PassKeys)
ja_jp: https://www.w3.org/TR/webauthn-3/#discoverable-credential[Discoverable Credentials] (PassKeys 付き) の場合、ユーザー名はオプションです。

source: The username is the `$ConnectionString` string.
ja_jp: ユーザー名は `$ConnectionString` です。

source: The username used to authenticate to the broker Type: _string_
ja_jp: ブローカーへの認証に使用されるユーザー名 Type: _string_

source: The usual way of obtaining connections to a database is to use a datasource and configure a JDBC driver. But you might also prefer using a reactive driver to connect to your database in a reactive way.
ja_jp: データベースへの接続を取得する一般的な方法は、データソースを使用して JDBC ドライバーを設定することです。しかし、リアクティブな方法でデータベースに接続するために、リアクティブなドライバーを使用することが好まれる場合もあります。

source: The value `/` is not allowed as it blocks the application from serving anything else. A value prefixed with '/' makes it absolute and not relative.
ja_jp: 値 `/` は、アプリケーションが他のサービスを提供できないようにブロックするため、許可されません。値の前に「/」を付けると、相対値ではなく絶対値になります。

source: The value held by the Redis key
ja_jp: Redisキーが保持する値

source: The value is ignored as `io.quarkus.qute.i18n.Message#value()` is always prioritized.
ja_jp: `io.quarkus.qute.i18n.Message#value()` は常に優先されるため、この値は無視されます。

source: The value is intentionally not provided. There's also no key/value pair for this method in a localized file.
ja_jp: 値は意図的に提供されていません。また、ローカライズされたファイルにはこのメソッドのキー/値のペアはありません。

source: The value is parsed with `DurationConverter#parseDuration(String)`. It can be a property expression, in which case, the scheduler attempts to use the configured value instead: `@Scheduled(executionMaxDelay = "${myJob.maxDelay}")`. Additionally, the property expression can specify a default value: `@Scheduled(executionMaxDelay = "${myJob.maxDelay}:500ms}")`.
ja_jp: 値は `DurationConverter#parseDuration (String)` で解析されます。 これはプロパティー式である可能性があり、その場合、スケジューラーは代わりに設定された値 (`@Scheduled (executionMaxDelay = "${myJob.maxDelay}")`) を使用しようとします。 さらに、プロパティー式ではデフォルト値 (`@Scheduled (実行最大遅延 = "${myJob.maxDelay}:500ms}")`) を指定できます。

source: The value is the locale tag string (IETF).
ja_jp: 値はロケールタグ文字列(IETF)です。

source: The value is the localized template.
ja_jp: 値はローカライズされたテンプレートです。

source: The value of `magic.source` can be customized in a platform descriptor like this
ja_jp: `magic.source` の値は、プラットフォーム記述子で次のようにカスタマイズできます。

source: The value of `produces()` is used for content-based routing for all routes where `Route#produces()` is empty.
ja_jp: `produces()` の値は、 `Route#produces()` が空のすべてのルートで、コンテンツベースのルーティングに使用されます。

source: The value of a https://tools.ietf.org/html/rfc3986#section-3.4[URI query parameter]
ja_jp: https://tools.ietf.org/html/rfc3986#section-3.4[URI query parameter] の値

source: The value of an https://developer.mozilla.org/en-US/docs/Web/HTTP/Methods/POST[HTTP URL-encoded FORM]
ja_jp: https://developer.mozilla.org/en-US/docs/Web/HTTP/Methods/POST[HTTP URL-encoded FORM] の値

source: The value of an https://tools.ietf.org/html/rfc3986#section-3.3[URI path segment parameter]
ja_jp: https://tools.ietf.org/html/rfc3986#section-3.3[URI パスセグメントパラメーター] の値

source: The value of an https://tools.ietf.org/html/rfc3986#section-3.4[URI query parameter]
ja_jp: https://tools.ietf.org/html/rfc3986#section-3.4[URI query parameter] の値

source: The value of an https://tools.ietf.org/html/rfc6265#section-4.2[HTTP cookie]
ja_jp: https://tools.ietf.org/html/rfc6265#section-4.2[HTTP cookie] の値

source: The value of an https://tools.ietf.org/html/rfc7230#section-3.2[HTTP header]
ja_jp: https://tools.ietf.org/html/rfc7230#section-3.2[HTTP ヘッダ] の値

source: The value of the `@Query` annotation is optional and would implicitly be defaulted to the method name if absent.
ja_jp: アノテーション `@Query` の値はオプションで、これがない場合は暗黙のうちにメソッド名がデフォルトになります。

source: The value of the `auth-mechanism` property must match the authentication scheme supported by HttpAuthenticationMechanism such as `basic` or `bearer` or `form`, etc.
ja_jp: `auth-mechanism` プロパティーの値は、 `basic`、 `bearer` または `form` などの HttpAuthenticationMechanism でサポートされている認証スキームと一致する必要があります。

source: The value of the metric. 3 invocations were made until now.
ja_jp: メトリクスの値。 これまでに 3 回の呼び出しが行われました。

source: The value of the property can be `none`, which is the default, or a comma-separated list of `groupId:artifactId` coordinates.
ja_jp: プロパティーの値は、デフォルト値である `none`、または `groupId:artifactId` 座標のコンマ区切りリストになります。

source: The value of the property may be `none`, which is the default value, or a comma separated list of `groupId:artifactId` coordinates.
ja_jp: プロパティの値は、デフォルト値である `none` 、または `groupId:artifactId` 座標のコンマ区切りリストとなります。

source: The value of these properties is configured in a `application.properties` file that follows the MicroProfile config format.
ja_jp: これらのプロパティーの値は、MicroProfile 設定形式に従う `application.properties` ファイルで設定されます。

source: The value range providers
ja_jp: 値の範囲プロバイダー

source: The values above allow the application to be completely agnostic of the actual database configuration used in production while also not inhibiting the usability of the application at development time.
ja_jp: 上記の値は、本番環境で使用されている実際のデータベース構成に完全に依存しないようにすると同時に、開発時のアプリケーションの使い勝手を阻害しないようにしています。

source: The values above are defined as properties in the generated `pom.xml` file.
ja_jp: 上記の値は、生成された `pom.xml` ファイルのプロパティーとして定義されています。

source: The values are grouped by message key (the weather station id)
ja_jp: 値はメッセージキー(weather station id)によってグループ化されます。

source: The values from this file override any values from the regular `application.yaml` file if exists.
ja_jp: このファイルの値は、通常の `application.yaml` ファイルが存在する場合、そちらの値よりも優先されます。

source: The values from this file override any values from the regular `application.yaml` file if it exists.
ja_jp: このファイルの値は、通常の `application.yaml` ファイルが存在する場合、そのファイルの値を上書きします。

source: The values of `quarkus.kubernetes-config.config-maps` and `quarkus.kubernetes-config.secrets` determine which ConfigMaps and/or Secrets will be used as configuration sources. Keep in mind that these ConfigMaps and Secrets must be in the same Kubernetes `Namespace` as the running application. If they are to be found in a different namespace, then `quarkus.kubernetes-config.namespace` must be set to the proper value.
ja_jp: `quarkus.kubernetes-config.config-maps` と `quarkus.kubernetes-config.secrets` の値は、どの ConfigMaps および/または Secrets を設定ソースとして使用するかを決定します。これらのConfigMapsとSecretsは、実行中のアプリケーションと同じKubernetes `Namespace` にある必要があることに留意してください。もしそれらが異なる名前空間にある場合は、 `quarkus.kubernetes-config.namespace` を適切な値に設定する必要があります。

source: The values of the `timeslot` and `room` fields are typically still `null`, so unassigned. They are planning variables.
ja_jp: `timeslot` フィールドと `room` フィールドの値は、通常の場合はまだ `null` であるため割り当てられていません。それはプランニング変数です。

source: The values of the generated probes will be determined by the configured health properties: `quarkus.smallrye-health.root-path`, `quarkus.smallrye-health.liveness-path` and `quarkus.smallrye-health.readiness-path`. More information about the health extension can be found in the relevant xref:microprofile-health.adoc[guide].
ja_jp: 生成されたプローブの値は、設定されたヘルスプロパティー (`quarkus.smallrye-health.root-path`、 `quarkus.smallrye-health.liveness-path`、および `quarkus.smallrye-health.readiness-path`) によって決定されます。health エクステンションの詳細については、関連する xref:microprofile-health.adoc[guide] を参照してください。

source: The values of the generated probes will be determined by the configured health properties: `quarkus.smallrye-health.root-path`, `quarkus.smallrye-health.liveness-path` and `quarkus.smallrye-health.readiness-path`. More information about the health extension can be found in the relevant xref:smallrye-health.adoc[guide].
ja_jp: 生成されたプローブの値は、設定されたヘルスプロパティー (`quarkus.smallrye-health.root-path`、`quarkus.smallrye-health.liveness-path` および `quarkus.smallrye-health.readiness-path`.) によって決定されます。 health エクステンションの詳細については、関連する xref:smallrye-health.adoc[ガイド] を参照してください。

source: The values you need to set on `quarkus.opentelemetry.tracer.sampler` are now:
ja_jp: `quarkus.opentelemetry.tracer.sampler` で設定する必要がある値は、現在、以下の通りです:

source: The variables are not available outside the defining `let` section. However, the end tag is optional, if missing then the section ends where the parent section ends.
ja_jp: 変数は、定義している `let` セクションの外では利用できません。ただし、終了タグはオプションで、省略された場合は親セクションの終了位置でセクションが終了します。

source: The verification process for OIDC authorization code flow tokens follows the Bearer token authentication and introspection logic. For more information, see the xref:security-oidc-bearer-token-authentication.adoc#bearer-token-token-verification-introspection[Token verification and introspection] section of the "Quarkus OpenID Connect (OIDC) Bearer token authentication" guide.
ja_jp: OIDC 認可コードフロートークンの検証プロセスは、ベアラートークン認証のトークン検証およびイントロスペクションのロジックに従います。 詳細は、「Quarkus OpenID Connect (OIDC) ベアラートークン認証」ガイドの xref:security-oidc-bearer-token-authentication.adoc#bearer-token-token-verification-introspection[トークンの検証とイントロスペクション] セクションを参照してください。

source: The verification process of OIDC authorization code flow tokens follows the Bearer token authentication token verification and introspection logic. For more information, see the xref:security-oidc-bearer-token-authentication.adoc#bearer-token-token-verification-introspection[Token verification and introspection] section of the "Quarkus OpenID Connect (OIDC) Bearer token authentication" guide.
ja_jp: OIDC 認可コードフロートークンの検証プロセスは、ベアラートークン認証トークンの検証とイントロスペクションのロジックに従います。 詳細は、「Quarkus OpenID Connect (OIDC) ベアラートークン認証」ガイドの xref:security-oidc-bearer-token-authentication.adoc#bearer-token-token-verification-introspection[トークンの検証とイントロスペクション] のセクションを参照してください。

source: The version 2 Quarkus CLI can not be used with 1.x Quarkus projects or releases. Use the Maven/Gradle plugins when working with Quarkus 1.x projects.
ja_jp: バージョン2のQuarkus CLIは、1.xのQuarkusプロジェクトやリリースでは使用できません。Quarkus 1.xプロジェクトで作業する場合は、Maven/Gradleプラグインを使用してください。

source: The version `2.6.3.Final` of the `quarkus-resteasy-reactive` is now reported as being misaligned with the version managed by the Quarkus platform BOM imported in the project, which is {quarkus-version}
ja_jp: quarkus-resteasy-reactive` のバージョン `2.6.3.Final` は、プロジェクトにインポートされた Quarkus プラットフォーム BOM によって管理されているバージョン ({quarkus-version}) と整合性がないと報告されるようになりました。

source: The version check is disabled by default when a dialect is set explicitly, as a workaround for https://github.com/quarkusio/quarkus/issues/42255[#42255]/link:https://github.com/quarkusio/quarkus/issues/43703[#43703].
ja_jp: ダイアレクトが明示的に設定されている場合、バージョンチェックはデフォルトで無効化されています。 これは https://github.com/quarkusio/quarkus/issues/42255[#42255]/link:https://github.com/quarkusio/quarkus/issues/43703[#43703] の回避策です。

source: The version currently recommended by the https://quarkus.io/guides/extension-registry-user[Quarkus Extension Registry]
ja_jp: 現在、 link:https://quarkus.io/guides/extension-registry-user[Quarkus Extension Registry]で推奨されているバージョン

source: The version currently recommended by the xref:extension-registry-user.adoc[Quarkus Extension Registry]
ja_jp: xref:extension-registry-user.adoc[Quarkus Extension Registry] が現在推奨しているバージョン

source: The version of Java you want the project to use.
ja_jp: プロジェクトで使用したいJavaのバージョン

source: The version of the JVM used to run the application must be **exactly** the same as the one used to build the Quarkus application.
ja_jp: アプリケーションの実行に使用するJVMのバージョンは、Quarkusアプリケーションのビルドに使用したものと *完全に* 同じである必要があります。

source: The version of the created project
ja_jp: 作成されたプロジェクトのバージョン

source: The version of the platform you want the project to use. It can also accept a version range, in which case the latest from the specified range will be used.
ja_jp: プロジェクトで使用したいプラットフォームのバージョンを指定します。バージョンの範囲を指定することもでき、その場合は指定した範囲の最新のものが使用されます。

source: The versions of musl and zlib may need to be updated to meet the native-image executable requirements (and UPX if you use native image compression).
ja_jp: ネイティブイメージの実行可能ファイルの要件に合わせて、muslとzlibのバージョンを更新する必要があるかもしれません（ネイティブイメージ圧縮を使用する場合はUPXも）。

source: The vertx-sql-client is a reactive client, hence it is not supposed to block while waiting for the completion of a transaction with the database. However, when using the link:{mutiny-vertx-sql}[smallrye-mutiny-vertx-sqlclient] it is possible to use a variant method that will await for the completion of the transaction, mimicking a blocking behaviour.
ja_jp: vertx-sql-client はリアクティブクライアントであり、データベースとのトランザクションの完了を待っている間はブロックしないことになっています。しかしながら、 link:{mutiny-vertx-sql}[smallrye-mutiny-vertx-sqlclient] を使用する場合、トランザクションの完了を待つ可変メソッドを使用し、ブロッキングの挙動を模倣することが可能です。

source: The very first allocation that all these threads do is taking the thread name and trimming it so that it can fall within the character limit enforced by kernels. For each of those allocations, there are 2 `mmap` calls, one to reserve the memory and the other to commit it. When recording `syscalls:sys_enter_mmap` system call, the `perf` implementation tracks calls to `__GI___mmap64`. But this glibc `__GI___mmap64` implementation makes another call into `__GI___mmap64`:
ja_jp: これらのスレッドが行う最初の割り当ては、スレッド名を取得し、カーネルが強制する文字数制限内に収まるようにトリミングすることです。これらの割り当てのそれぞれについて、2つの `mmap` 呼び出しがあります。1つはメモリを予約するため、もう1つはそれをコミットするためです。 `syscalls:sys_enter_mmap` システムコールを記録する場合、 `perf` の実装は、以下の呼び出しを追跡します。 `_GI_ _mmap64` .しかし、このglibc `_GI_ _mmap64` の実装では、別の呼び出しが行われます。 `_GI_ _mmap64` :

source: The very first thing to check is to ensure the anonymous access works.
ja_jp: まず最初に確認すべきは、匿名でのアクセスが可能かどうかということです。

source: The virtual host to use when connecting to the broker Type: _string_
ja_jp: ブローカーに接続するときに使用する仮想ホスト Type: _string_

source: The volumes themselves can be configured as shown in the sections below:
ja_jp: ボリューム自体は、以下のセクションに示すように設定することができます。

source: The way `quarkus:update` works, first, all the direct Quarkus extension dependencies of the project are collected (those that are managed by the Quarkus platform BOMs and those that aren't but found in the Quarkus extension registries). Then the configured Quarkus extension registries (typically the `registry.quarkus.io`) will be queried for the latest recommended/supported Quarkus platform versions and non-platform Quarkus extensions compatible with them. The algorithm will then select the latest compatible combination of all the extensions found in the project, assuming such a combination actually exists. Otherwise, no updates will be suggested.
ja_jp: `quarkus:update` が機能する方法では、最初に、プロジェクトのすべての直接的な Quarkus エクステンションの依存関係が収集されます (Quarkus プラットフォームの BOM によって管理されるものと、管理されないけれども Quarkus エクステンションレジストリーにあるもの)。次に、設定された Quarkus エクステンションレジストリー (通常は `registry.quarkus.io`) が、最新の推奨/サポートされる Quarkus プラットフォームバージョンおよびそれらと互換性のあるプラットフォーム以外の Quarkus エクステンションについてクエリーされます。続いて、アルゴリズムは、プロジェクトで見つかったすべてのエクステンションの最新の互換性のある組み合わせを選択します (そのような組み合わせが実際に存在する場合)。そうでない場合は、更新は提案されません。

source: The way such instances are dealt with, and how their lifecycle is orchestrated, is something that pertains to the application domain. For example, the above implementation doesn't take concurrency into account. If multiple threads are going to consume the same `Memory` instance, a thread-safe implementation would be required in order to avoid corrupting the shared `WasmModule` linear memory.
ja_jp: これらのインスタンスの扱い方やライフサイクルのオーケストレーション方法は、アプリケーションドメインに属する事項です。例えば、上記のターゲット実装は並行性を考慮していません。複数のスレッドが同じ `Memory` インスタンスを消費する場合、共有されている `WasmModule` の線形メモリーの破損を避けるために、スレッドセーフな実装が必要になります。

source: The way the extensions can be enabled and disabled is very different. The OpenTelemetry extension is enabled by default and you can disable all or parts of it by checking xref:opentelemetry.adoc#disable-all-or-parts-of-the-opentelemetry-extension[this section of the OpenTelemetry guide].
ja_jp: エクステンションを有効化および無効化する方法は大きく異なります。OpenTelemetry エクステンションはデフォルトで有効になっており、xref:opentelemetry.adoc#disable-all-or-parts-of-the-opentelemetry-extension[tOpenTelemetry ガイドのこちらのセクション] をチェックすることで、エクステンションのすべてまたは一部を無効にすることができます。

source: The way the roles are mapped to the SecurityIdentity roles from the verified tokens is identical to how it is done for the xref:security-oidc-bearer-token-authentication.adoc[Bearer tokens]. The only difference is that https://openid.net/specs/openid-connect-core-1_0.html#IDToken[ID token] is used as a source of the roles by default.
ja_jp: 検証済みトークンから SecurityIdentity ロールにロールをマッピングする方法は、xref:security-oidc-bearer-token-authentication.adoc[ベアラートークン] の方法と同じです。 唯一の違いは、 https://openid.net/specs/openid-connect-core-1_0.html#IDToken[ID トークン] がデフォルトでロールのソースとして使用されることです。

source: The way the roles are mapped to the SecurityIdentity roles from the verified tokens is identical to how it is done for the xref:security-oidc-bearer-token-authentication.adoc[Bearer tokens]. The only difference is that https://openid.net/specs/openid-connect-core-1_0.html#IDToken[ID token] is used by default as the source of roles.
ja_jp: 検証済みトークンから SecurityIdentity ロールにロールをマッピングする方法は、xref:security-oidc-bearer-token-authentication.adoc[ベアラートークン] の方法と同じです。 唯一の違いは、 https://openid.net/specs/openid-connect-core-1_0.html#IDToken[ID トークン] がデフォルトでロールのソースとして使用されることです。

source: The way the roles are mapped to the SecurityIdentity roles from the verified tokens is identical to how it is done for the xref:security-openid-connect.adoc#token-claims-and-securityidentity-roles[bearer tokens] with the only difference being is that https://openid.net/specs/openid-connect-core-1_0.html#IDToken[ID Token] is used as a source of the roles by default.
ja_jp: 検証済みトークンからSecurityIdentityのロールにロールをマッピングする方法は、 xref:security-openid-connect.adoc#token-claims-and-securityidentity-roles[ベアラートークン] の場合と同じですが、唯一の違いは、 xref:https://openid.net/specs/openid-connect-core-1_0.html#IDToken[IDトークン] がデフォルトでロールのソースとして使用されるということです。

source: The whole configuration documentation should not be included in the middle of the guide.
ja_jp: 設定ドキュメント全体はガイドの途中に入れるべきではありません。

source: The wildcard in the `/*/hello` represents exactly one path segment. Nevertheless, the wildcard is less specific than the `api`, therefore the `hr` tenant will be used.
ja_jp: `/*/hello` のワイルドカードは、1 つのパスセグメントのみを表します。ただし、ワイルドカードは `api` ほど具体的ではないため、`hr` テナントが使用されます。

source: The wildcard is ignored and the `java.lang.Object` is used instead: `{@java.util.Optional<java.lang.Object>}`
ja_jp: ワイルドカードは無視され、代わりに上限値が使用されます: `{@java.util.Optional<java.lang.Object>}`

source: The wildcard is ignored and the upper bound is used instead: `{@java.util.Map<String,Number>}`
ja_jp: ワイルドカードは無視され、代わりに上限値が使用されます: `{@java.util.Map<String,Number>}`

source: The wildcard placed at the end of the path represents any number of path segments. However the path is less specific than the `/api/hello`, therefore the `hr` tenant will be used to secure the `sayHello` endpoint.
ja_jp: パスの末尾に置かれたワイルドカードは、任意の数のパスセグメントを表します。ただし、パスは `/api/hello` よりも具体的ではないため、`sayHello` エンドポイントを保護するために `hr` テナントが使用されます。

source: The winning role-based policy that was chosen to authorize the current request can map `SecurityIdentity` roles to deployment-specific roles. These roles are then applicable for endpoint authorization by using the `@RolesAllowed` annotation.
ja_jp: 現在のリクエストを認可するために選択された優先ロールベースポリシーは、 `SecurityIdentity` ロールをデプロイメント固有のロールにマッピングできます。これらのロールは、 `@RolesAllowed` アノテーションを使用してエンドポイント認可に適用できます。

source: The word `hello` should be displayed.
ja_jp: `hello` という単語が表示されます。

source: The work on implementing Redis commands in our Redis extension API continues. In Quarkus 2.14, support for JSON commands, graph commands and probabilistic data structures has been added.
ja_jp: RedisエクステンションAPIにRedisコマンドを実装する作業は継続して行われています。Quarkus 2.14では、JSONコマンド、グラフコマンド、確率的データ構造のサポートが追加されました。

source: The workaround for now is to disable annotation processors in your IDE (that might not work very well if you're using others though).
ja_jp: 今のところの回避策は、IDEでアノテーションプロセッサを無効にすることです（他のものを使用している場合は、あまりうまくいかないかもしれません）。
